#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/initialised-si/JoWe-API/runs/run-45DtCkiRNYzEqhFS

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
module.lambda.data.archive_file.weight_shared_layer_zip: Refreshing...
module.lambda.data.archive_file.weight_targets_insert_zip: Refreshing...
module.lambda.data.archive_file.weight_targets_retrieve_zip: Refreshing...
module.lambda.data.archive_file.weight_shared_layer_zip: Refresh complete after 0s [id=ed97ce2fff81f9e2b456bb5a9db4f68c908b3883]
module.lambda.data.archive_file.weight_measurements_delete_user_data_zip: Refreshing...
module.lambda.data.archive_file.weight_measurements_insert_zip: Refreshing...
module.lambda.data.archive_file.weight_measurements_retrieve_zip: Refreshing...
module.lambda.data.archive_file.weight_targets_insert_zip: Refresh complete after 0s [id=5b89fea08bcfdac04cbdf0fcf8390ae3c14cf5fe]
module.lambda.data.archive_file.weight_targets_delete_zip: Refreshing...
module.lambda.data.archive_file.weight_measurements_retrieve_zip: Refresh complete after 0s [id=3362bcc29ed7cdb8f99044734d23bf8df3868e8e]
module.lambda.data.archive_file.weight_measurements_delete_user_data_zip: Refresh complete after 0s [id=9f0d18e912544744ea1f7bdb3f0f3389940a275e]
module.lambda.data.archive_file.weight_targets_retrieve_zip: Refresh complete after 0s [id=f298a281d43b744419ba3a4751bc4ee1543dc030]
module.lambda.data.archive_file.weight_targets_delete_user_data_zip: Refreshing...
module.lambda.data.archive_file.weight_measurements_delete_zip: Refreshing...
module.lambda.data.archive_file.common_layer_zip: Refreshing...
module.lambda.data.archive_file.weight_targets_delete_zip: Refresh complete after 0s [id=9d4473f521220ead636da903d0068b57bcfd418c]
module.lambda.data.archive_file.weight_measurements_insert_zip: Refresh complete after 0s [id=ab986d546df92ff807680da3972b8e33cc466971]
module.lambda.data.archive_file.weight_targets_delete_user_data_zip: Refresh complete after 0s [id=7c358a38538c799391ead2dc1755227c1d5182da]
module.lambda.data.archive_file.weight_measurements_delete_zip: Refresh complete after 0s [id=af452fcd699443d0dac8a2b27011e36bcfbde462]
module.lambda.data.archive_file.common_layer_zip: Refresh complete after 0s [id=fb56b60127d16b98ac3286578cc4850547fba4a2]
module.lambda.aws_cloudwatch_log_group.weight_targets_delete_user_data_lambda_log_group: Refreshing state... [id=/aws/lambda/JoWe-api-weight-targets-delete-user-data]
module.sns_and_sqs.aws_sqs_queue.weight_targets_delete_user_data_dead_letter_queue: Refreshing state... [id=https://sqs.eu-south-1.amazonaws.com/834514932971/JoWe-weight-targets-delete-user-data-dead-letter]
module.lambda.data.aws_iam_policy_document.assume_role: Refreshing...
module.lambda.aws_cloudwatch_log_group.weight_measurements_delete_user_data_lambda_log_group: Refreshing state... [id=/aws/lambda/JoWe-api-weight-measurements-delete-user-data]
module.lambda.aws_cloudwatch_log_group.weight_targets_insert_lambda_log_group: Refreshing state... [id=/aws/lambda/JoWe-api-weight-targets-insert]
module.db.aws_dynamodb_table.jowe_weight_targets: Refreshing state... [id=JoWe-weight-targets]
module.lambda.data.aws_iam_policy.AWSLambdaBasicExecutionRole: Refreshing...
module.api.data.aws_iam_policy_document.assume_role: Refreshing...
module.sns_and_sqs.aws_sqs_queue.weight_measurements_delete_user_data_dead_letter_queue: Refreshing state... [id=https://sqs.eu-south-1.amazonaws.com/834514932971/JoWe-weight-measurements-delete-user-data-dead-letter]
module.lambda.data.aws_iam_policy_document.assume_role: Refresh complete after 0s [id=2690255455]
module.lambda.aws_cloudwatch_log_group.weight_measurements_delete_lambda_log_group: Refreshing state... [id=/aws/lambda/JoWe-api-weight-measurements-delete]
module.api.data.aws_iam_policy_document.assume_role: Refresh complete after 0s [id=2699642182]
module.lambda.aws_cloudwatch_log_group.weight_measurements_insert_lambda_log_group: Refreshing state... [id=/aws/lambda/JoWe-api-weight-measurements-insert]
module.lambda.aws_cloudwatch_log_group.weight_targets_retrieve_lambda_log_group: Refreshing state... [id=/aws/lambda/JoWe-api-weight-targets-retrieve]
module.lambda.data.aws_iam_policy.AWSLambdaBasicExecutionRole: Refresh complete after 1s [id=arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole]
module.auth.aws_cognito_user_pool.user_pool: Refreshing state... [id=eu-south-1_ILruQHIrm]
module.db.aws_dynamodb_table.jowe_measurements: Refreshing state... [id=JoWe-weight-measurements]
module.lambda.aws_lambda_layer_version.weight_shared_layer: Refreshing state... [id=arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-weight-shared-layer:9]
module.lambda.aws_lambda_layer_version.common_layer: Refreshing state... [id=arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-common-layer:23]
module.api.aws_api_gateway_rest_api.jowe_api: Refreshing state... [id=29ugyjajxi]
module.sns_and_sqs.aws_sns_topic.delete_user_data: Refreshing state... [id=arn:aws:sns:eu-south-1:834514932971:JoWe-delete-user-data-topic]
module.lambda.aws_cloudwatch_log_group.weight_measurements_retrieve_lambda_log_group: Refreshing state... [id=/aws/lambda/JoWe-api-weight-measurements-retrieve]
module.api.aws_api_gateway_domain_name.custom_domain_name: Refreshing state... [id=jowe-api.initialised.si]
module.lambda.aws_cloudwatch_log_group.weight_targets_delete_lambda_log_group: Refreshing state... [id=/aws/lambda/JoWe-api-weight-targets-delete]
module.lambda.aws_iam_role.jowe_api_lambda_read_only: Refreshing state... [id=JoWe-api-lambda-read-only]
module.lambda.aws_iam_role.jowe_api_lambda_crud: Refreshing state... [id=JoWe-api-lambda-crud]
module.api.aws_iam_role.jowe_api_gateway_sns: Refreshing state... [id=JoWe-api-gateway-sns]
module.sns_and_sqs.aws_sqs_queue.weight_targets_delete_user_data_queue: Refreshing state... [id=https://sqs.eu-south-1.amazonaws.com/834514932971/JoWe-weight-targets-delete-user-data]
module.sns_and_sqs.aws_sqs_queue.weight_measurements_delete_user_data_queue: Refreshing state... [id=https://sqs.eu-south-1.amazonaws.com/834514932971/JoWe-weight-measurements-delete-user-data]
module.lambda.aws_iam_role_policy_attachment.jowe_api_lambda_read_only_AWSLambdaBasicExecutionRole_attachment: Refreshing state... [id=JoWe-api-lambda-read-only-20230430164206859500000002]
module.auth.aws_cognito_user_pool_client.client: Refreshing state... [id=1rdt8iiuvui8or0pf24cabml30]
module.db.data.aws_iam_policy_document.dynamodb_jowe_weight_target_crud_policy: Refreshing...
module.db.data.aws_iam_policy_document.dynamodb_jowe_weight_target_crud_policy: Refresh complete after 0s [id=2268919999]
module.db.data.aws_iam_policy_document.dynamodb_jowe_weight_target_read_only_policy: Refreshing...
module.db.data.aws_iam_policy_document.dynamodb_jowe_weight_target_read_only_policy: Refresh complete after 0s [id=1399755413]
module.lambda.aws_iam_role_policy_attachment.jowe_api_lambda_crud_AWSLambdaBasicExecutionRole_attachment: Refreshing state... [id=JoWe-api-lambda-crud-20230430164206853100000001]
module.db.aws_iam_policy.dynamodb_weight_target_crud_policy: Refreshing state... [id=arn:aws:iam::834514932971:policy/JoWe-dynamodb-weight-target-crud-policy]
module.db.aws_iam_policy.dynamodb_weight_target_read_only_policy: Refreshing state... [id=arn:aws:iam::834514932971:policy/JoWe-dynamodb-weight-target-read-only-policy]
module.api.aws_api_gateway_model.weight_measurments_insert_request: Refreshing state... [id=fow9we]
module.api.aws_api_gateway_model.weight_target_response: Refreshing state... [id=im64ji]
module.api.aws_api_gateway_model.weight_measurments_response: Refreshing state... [id=yjnmol]
module.api.aws_api_gateway_request_validator.jowe_api_request_validator: Refreshing state... [id=2jluq1]
module.api.aws_api_gateway_authorizer.jowe_api_authorizer: Refreshing state... [id=9deiui]
module.api.aws_api_gateway_model.common_error_response: Refreshing state... [id=x37z0p]
module.api.aws_api_gateway_gateway_response.jowe_api_gateway_response_default_5XX: Refreshing state... [id=aggr-29ugyjajxi-DEFAULT_5XX]
module.api.aws_api_gateway_model.weight_targets_response: Refreshing state... [id=8me7sn]
module.api.aws_api_gateway_gateway_response.jowe_api_gateway_response_default_4XX: Refreshing state... [id=aggr-29ugyjajxi-DEFAULT_4XX]
module.api.aws_api_gateway_resource.weight_resource: Refreshing state... [id=2t34hb]
module.api.aws_api_gateway_model.weight_measurment_response: Refreshing state... [id=8ncqyk]
module.api.aws_api_gateway_model.weight_targets_insert_request: Refreshing state... [id=we4rvu]
module.api.aws_api_gateway_resource.admin_resource: Refreshing state... [id=cime6b]
module.sns_and_sqs.data.aws_iam_policy_document.sqs_weight_targets_delete_user_data_queue_process_policy: Refreshing...
module.sns_and_sqs.data.aws_iam_policy_document.sqs_weight_targets_delete_user_data_queue_process_policy: Refresh complete after 0s [id=3069482512]
module.sns_and_sqs.aws_sqs_queue_policy.delete_user_data_weight_targets_subscription: Refreshing state... [id=https://sqs.eu-south-1.amazonaws.com/834514932971/JoWe-weight-targets-delete-user-data]
module.sns_and_sqs.data.aws_iam_policy_document.sns_delete_user_data_topic_publish_policy: Refreshing...
module.sns_and_sqs.data.aws_iam_policy_document.sns_delete_user_data_topic_publish_policy: Refresh complete after 0s [id=2512271668]
module.sns_and_sqs.aws_sns_topic_subscription.delete_user_data_weight_targets: Refreshing state... [id=arn:aws:sns:eu-south-1:834514932971:JoWe-delete-user-data-topic:bfd02f8f-2e2f-4069-9bf8-b996ed9c110e]
module.sns_and_sqs.data.aws_iam_policy_document.sqs_weight_measurements_delete_user_data_queue_process_policy: Refreshing...
module.sns_and_sqs.data.aws_iam_policy_document.sqs_weight_measurements_delete_user_data_queue_process_policy: Refresh complete after 0s [id=4191769778]
module.sns_and_sqs.aws_sns_topic_subscription.delete_user_data_weight_measurements: Refreshing state... [id=arn:aws:sns:eu-south-1:834514932971:JoWe-delete-user-data-topic:38e470d2-3b09-45b9-a378-a869bc6e7e6a]
module.sns_and_sqs.aws_sqs_queue_policy.delete_user_data_weight_measurements_subscription: Refreshing state... [id=https://sqs.eu-south-1.amazonaws.com/834514932971/JoWe-weight-measurements-delete-user-data]
module.sns_and_sqs.aws_iam_policy.sqs_weight_targets_delete_user_data_queue_process_policy: Refreshing state... [id=arn:aws:iam::834514932971:policy/JoWe-sqs-weight-targets-delete-user-data-queue-policy]
module.sns_and_sqs.aws_iam_policy.sns_delete_user_data_topic_publish_policy: Refreshing state... [id=arn:aws:iam::834514932971:policy/JoWe-sns-delete-user-data-topic-publish-policy]
module.db.data.aws_iam_policy_document.dynamodb_jowe_measurements_crud_policy: Refreshing...
module.db.data.aws_iam_policy_document.dynamodb_read_only_policy_doc: Refreshing...
module.db.data.aws_iam_policy_document.dynamodb_read_only_policy_doc: Refresh complete after 0s [id=1165076430]
module.db.data.aws_iam_policy_document.dynamodb_jowe_measurements_crud_policy: Refresh complete after 0s [id=284655049]
module.sns_and_sqs.aws_iam_policy.sqs_weight_measurements_delete_user_data_queue_process_policy: Refreshing state... [id=arn:aws:iam::834514932971:policy/JoWe-sqs-weight-measurements-delete-user-data-queue-policy]
module.db.aws_iam_policy.dynamodb_measurements_read_only_policy: Refreshing state... [id=arn:aws:iam::834514932971:policy/JoWe-dynamodb-measurements-read-only-policy]
module.db.aws_iam_policy.dynamodb_measurements_crud_policy: Refreshing state... [id=arn:aws:iam::834514932971:policy/JoWe-dynamodb-measurements-crud-policy]
module.api.aws_api_gateway_resource.weight_targets_resource: Refreshing state... [id=ovn852]
module.api.aws_api_gateway_resource.delete_user_data: Refreshing state... [id=hpn5zy]
module.api.aws_api_gateway_resource.weight_measurements_resource: Refreshing state... [id=gh64ad]
module.api.aws_iam_role_policy_attachment.jowe_api_gateway_sns_delete_user_data_topic_publish_role_attachment: Refreshing state... [id=JoWe-api-gateway-sns-20230513193120220100000001]
module.lambda.aws_iam_role_policy_attachment.jowe_api_lambda_sqs_processing_weight_targets_delete_user_data_role_attachment: Refreshing state... [id=JoWe-api-lambda-crud-20230511204002701700000001]
module.lambda.aws_iam_role_policy_attachment.jowe_api_lambda_sqs_processing_weight_measurements_delete_user_data_role_attachment: Refreshing state... [id=JoWe-api-lambda-crud-20230511204002709800000002]
module.lambda.aws_iam_role_policy_attachment.jowe_api_lambda_dynamodb_read_only_role_attachment_weight_targets: Refreshing state... [id=JoWe-api-lambda-read-only-20230510113129488600000002]
module.lambda.aws_iam_role_policy_attachment.jowe_api_lambda_dynamodb_read_only_role_attachment_weight_measurements: Refreshing state... [id=JoWe-api-lambda-read-only-20230510130445534100000002]
module.lambda.aws_iam_role_policy_attachment.jowe_api_lambda_dynamodb_crud_role_attachment_weight_targets: Refreshing state... [id=JoWe-api-lambda-crud-20230510113129488300000001]
module.lambda.aws_iam_role_policy_attachment.jowe_api_lambda_dynamodb_crud_role_attachment_weight_measurements: Refreshing state... [id=JoWe-api-lambda-crud-20230510130445520500000001]
module.lambda.aws_lambda_function.weight_measurements_retrieve_lambda: Refreshing state... [id=JoWe-api-weight-measurements-retrieve]
module.lambda.aws_lambda_function.weight_targets_retrieve_lambda: Refreshing state... [id=JoWe-api-weight-targets-retrieve]
module.lambda.aws_lambda_function.weight_targets_delete_lambda: Refreshing state... [id=JoWe-api-weight-targets-delete]
module.lambda.aws_lambda_function.weight_targets_insert_lambda: Refreshing state... [id=JoWe-api-weight-targets-insert]
module.lambda.aws_lambda_function.weight_targets_delete_user_data_lambda: Refreshing state... [id=JoWe-api-weight-targets-delete-user-data]
module.lambda.aws_lambda_function.weight_measurements_insert_lambda: Refreshing state... [id=JoWe-api-weight-measurements-insert]
module.lambda.aws_lambda_function.weight_measurements_delete_user_data_lambda: Refreshing state... [id=JoWe-api-weight-measurements-delete-user-data]
module.api.aws_api_gateway_method.delete_user_data_method_options: Refreshing state... [id=agm-29ugyjajxi-hpn5zy-OPTIONS]
module.api.aws_api_gateway_method.delete_user_data_method_post: Refreshing state... [id=agm-29ugyjajxi-hpn5zy-POST]
module.lambda.aws_lambda_function.weight_measurements_delete_lambda: Refreshing state... [id=JoWe-api-weight-measurements-delete]
module.api.aws_api_gateway_method.weight_measurements_method_options: Refreshing state... [id=agm-29ugyjajxi-gh64ad-OPTIONS]
module.api.aws_api_gateway_method.weight_targets_method_options: Refreshing state... [id=agm-29ugyjajxi-ovn852-OPTIONS]
module.api.aws_api_gateway_method.weight_targets_method_post: Refreshing state... [id=agm-29ugyjajxi-ovn852-POST]
module.api.aws_api_gateway_resource.weight_measurements_id_resource: Refreshing state... [id=ywsgvl]
module.api.aws_api_gateway_method.weight_targets_method_get: Refreshing state... [id=agm-29ugyjajxi-ovn852-GET]
module.api.aws_api_gateway_method.weight_measurements_method_get: Refreshing state... [id=agm-29ugyjajxi-gh64ad-GET]
module.api.aws_api_gateway_method.weight_measurements_method_post: Refreshing state... [id=agm-29ugyjajxi-gh64ad-POST]
module.api.aws_api_gateway_resource.weight_targets_id_resource: Refreshing state... [id=tp6pe7]
module.api.aws_api_gateway_integration.delete_user_data_integration_options: Refreshing state... [id=agi-29ugyjajxi-hpn5zy-OPTIONS]
module.api.aws_api_gateway_integration.delete_user_data_integration_post: Refreshing state... [id=agi-29ugyjajxi-hpn5zy-POST]
module.api.aws_api_gateway_integration.weight_measurements_integration_options: Refreshing state... [id=agi-29ugyjajxi-gh64ad-OPTIONS]
module.api.aws_api_gateway_method.weight_measurements_id_method_get: Refreshing state... [id=agm-29ugyjajxi-ywsgvl-GET]
module.api.aws_api_gateway_integration.weight_targets_integration_options: Refreshing state... [id=agi-29ugyjajxi-ovn852-OPTIONS]
module.api.aws_api_gateway_method.weight_measurements_id_method_delete: Refreshing state... [id=agm-29ugyjajxi-ywsgvl-DELETE]
module.api.aws_api_gateway_method.weight_measurements_id_method_options: Refreshing state... [id=agm-29ugyjajxi-ywsgvl-OPTIONS]
module.api.aws_api_gateway_method.weight_targets_id_method_get: Refreshing state... [id=agm-29ugyjajxi-tp6pe7-GET]
module.api.aws_api_gateway_method.weight_targets_id_method_delete: Refreshing state... [id=agm-29ugyjajxi-tp6pe7-DELETE]
module.api.aws_api_gateway_method.weight_targets_id_method_options: Refreshing state... [id=agm-29ugyjajxi-tp6pe7-OPTIONS]
module.lambda.aws_lambda_event_source_mapping.sqs_lambda_event_source_mapping_weight_measurements_delete_user_data: Refreshing state... [id=1a39b272-95ad-4aaa-8128-9c42eabd0277]
module.lambda.aws_lambda_event_source_mapping.sqs_lambda_event_source_mapping_weight_targets_delete_user_data: Refreshing state... [id=90930095-ce8d-4dab-a380-06ebcf89abbb]
module.api.aws_api_gateway_method_response.delete_user_data_method_options_200: Refreshing state... [id=agmr-29ugyjajxi-hpn5zy-OPTIONS-200]
module.api.aws_api_gateway_method_response.delete_user_data_method_post_200: Refreshing state... [id=agmr-29ugyjajxi-hpn5zy-POST-200]
module.api.aws_api_gateway_method_response.delete_user_data_method_post_500: Refreshing state... [id=agmr-29ugyjajxi-hpn5zy-POST-500]
module.api.aws_api_gateway_method_response.weight_measurements_method_options_200: Refreshing state... [id=agmr-29ugyjajxi-gh64ad-OPTIONS-200]
module.api.aws_api_gateway_method_response.weight_targets_method_options_200: Refreshing state... [id=agmr-29ugyjajxi-ovn852-OPTIONS-200]
module.api.aws_api_gateway_integration.weight_measurements_id_integration_options: Refreshing state... [id=agi-29ugyjajxi-ywsgvl-OPTIONS]
module.api.aws_lambda_permission.gateway_lambda_permission_get_id_weight_measurement: Refreshing state... [id=terraform-20230510174622735000000002]
module.api.aws_lambda_permission.gateway_lambda_permission_retrieve_all_weight_targets: Refreshing state... [id=terraform-20230510185711724400000001]
module.api.aws_lambda_permission.gateway_lambda_permission_post_weight_measurements: Refreshing state... [id=terraform-20230510174622734000000001]
module.api.aws_lambda_permission.gateway_lambda_permission_post_weight_targets: Refreshing state... [id=terraform-20230510185711744500000002]
module.api.aws_lambda_permission.gateway_lambda_permission_get_id_weight_target: Refreshing state... [id=terraform-20230510185712013500000004]
module.api.aws_lambda_permission.gateway_lambda_permission_retrieve_single_weight_target: Refreshing state... [id=terraform-20230510185711860100000003]
module.api.aws_lambda_permission.gateway_lambda_permission_retrieve_all_weight_measurements: Refreshing state... [id=terraform-20230510174622735400000005]
module.api.aws_lambda_permission.gateway_lambda_permission_delete_weight_target: Refreshing state... [id=terraform-20230510185712024700000005]
module.api.aws_lambda_permission.gateway_lambda_permission_delete_weight_measurement: Refreshing state... [id=terraform-20230510174622735300000004]
module.api.aws_lambda_permission.gateway_lambda_permission_retrieve_single_weight_measurements: Refreshing state... [id=terraform-20230510174622735100000003]
module.api.aws_api_gateway_integration.weight_targets_id_integration_options: Refreshing state... [id=agi-29ugyjajxi-tp6pe7-OPTIONS]
module.api.aws_api_gateway_integration_response.delete_user_data_integration_res_options_200: Refreshing state... [id=agir-29ugyjajxi-hpn5zy-OPTIONS-200]
module.api.aws_api_gateway_integration_response.weight_measurements_integration_res_options_200: Refreshing state... [id=agir-29ugyjajxi-gh64ad-OPTIONS-200]
module.api.aws_api_gateway_integration_response.weight_targets_integration_res_options_200: Refreshing state... [id=agir-29ugyjajxi-ovn852-OPTIONS-200]
module.api.aws_api_gateway_integration_response.delete_user_data_integration_res_post_500: Refreshing state... [id=agir-29ugyjajxi-hpn5zy-POST-500]
module.api.aws_api_gateway_integration.weight_measurements_id_integration_get: Refreshing state... [id=agi-29ugyjajxi-ywsgvl-GET]
module.api.aws_api_gateway_method_response.weight_measurements_id_method_res_options_200: Refreshing state... [id=agmr-29ugyjajxi-ywsgvl-OPTIONS-200]
module.api.aws_api_gateway_integration.weight_measurements_integration_post: Refreshing state... [id=agi-29ugyjajxi-gh64ad-POST]
module.api.aws_api_gateway_integration.weight_targets_integration_get: Refreshing state... [id=agi-29ugyjajxi-ovn852-GET]
module.api.aws_api_gateway_integration.weight_targets_id_integration_get: Refreshing state... [id=agi-29ugyjajxi-tp6pe7-GET]
module.api.aws_api_gateway_integration.weight_targets_integration_post: Refreshing state... [id=agi-29ugyjajxi-ovn852-POST]
module.api.aws_api_gateway_integration.weight_measurements_integration_get: Refreshing state... [id=agi-29ugyjajxi-gh64ad-GET]
module.api.aws_api_gateway_integration.weight_targets_id_integration_delete: Refreshing state... [id=agi-29ugyjajxi-tp6pe7-DELETE]
module.api.aws_api_gateway_integration.weight_measurements_id_integration_delete: Refreshing state... [id=agi-29ugyjajxi-ywsgvl-DELETE]
module.api.aws_api_gateway_method_response.weight_targets_id_method_res_options_200: Refreshing state... [id=agmr-29ugyjajxi-tp6pe7-OPTIONS-200]
module.api.aws_api_gateway_method_response.weight_measurements_id_method_res_get_200: Refreshing state... [id=agmr-29ugyjajxi-ywsgvl-GET-200]
module.api.aws_api_gateway_method_response.weight_measurements_id_method_res_get_500: Refreshing state... [id=agmr-29ugyjajxi-ywsgvl-GET-500]
module.api.aws_api_gateway_method_response.weight_measurements_id_method_res_get_400: Refreshing state... [id=agmr-29ugyjajxi-ywsgvl-GET-400]
module.api.aws_api_gateway_integration_response.delete_user_data_integration_res_post_200: Refreshing state... [id=agir-29ugyjajxi-hpn5zy-POST-200]
module.api.aws_api_gateway_method_response.weight_targets_id_method_delete_500: Refreshing state... [id=agmr-29ugyjajxi-tp6pe7-DELETE-500]
module.api.aws_api_gateway_method_response.weight_targets_id_method_delete_200: Refreshing state... [id=agmr-29ugyjajxi-tp6pe7-DELETE-200]
module.api.aws_api_gateway_method_response.weight_measurements_id_method_delete_200: Refreshing state... [id=agmr-29ugyjajxi-ywsgvl-DELETE-200]
module.api.aws_api_gateway_method_response.weight_measurements_id_method_delete_500: Refreshing state... [id=agmr-29ugyjajxi-ywsgvl-DELETE-500]
module.api.aws_api_gateway_integration_response.weight_measurements_id_integration_res_options_200: Refreshing state... [id=agir-29ugyjajxi-ywsgvl-OPTIONS-200]
module.api.aws_api_gateway_integration_response.weight_measurements_id_integration_res_get_200: Refreshing state... [id=agir-29ugyjajxi-ywsgvl-GET-200]
module.api.aws_api_gateway_integration_response.weight_measurements_id_integration_res_get_500: Refreshing state... [id=agir-29ugyjajxi-ywsgvl-GET-500]
module.api.aws_api_gateway_method_response.weight_targets_method_get_200: Refreshing state... [id=agmr-29ugyjajxi-ovn852-GET-200]
module.api.aws_api_gateway_method_response.weight_targets_method_get_400: Refreshing state... [id=agmr-29ugyjajxi-ovn852-GET-400]
module.api.aws_api_gateway_method_response.weight_targets_method_get_500: Refreshing state... [id=agmr-29ugyjajxi-ovn852-GET-500]
module.api.aws_api_gateway_integration_response.weight_measurements_id_integration_res_get_400: Refreshing state... [id=agir-29ugyjajxi-ywsgvl-GET-400]
module.api.aws_api_gateway_integration_response.weight_targets_id_integration_res_delete_500: Refreshing state... [id=agir-29ugyjajxi-tp6pe7-DELETE-500]
module.api.aws_api_gateway_integration_response.weight_targets_id_integration_res_delete_200: Refreshing state... [id=agir-29ugyjajxi-tp6pe7-DELETE-200]
module.api.aws_api_gateway_integration_response.weight_measurements_id_integration_res_delete_200: Refreshing state... [id=agir-29ugyjajxi-ywsgvl-DELETE-200]
module.api.aws_api_gateway_integration_response.weight_targets_id_integration_res_options_200: Refreshing state... [id=agir-29ugyjajxi-tp6pe7-OPTIONS-200]
module.api.aws_api_gateway_integration_response.weight_measurements_id_integration_res_delete_500: Refreshing state... [id=agir-29ugyjajxi-ywsgvl-DELETE-500]
module.api.aws_api_gateway_method_response.weight_measurements_method_get_200: Refreshing state... [id=agmr-29ugyjajxi-gh64ad-GET-200]
module.api.aws_api_gateway_method_response.weight_measurements_method_get_500: Refreshing state... [id=agmr-29ugyjajxi-gh64ad-GET-500]
module.api.aws_api_gateway_method_response.weight_measurements_method_get_400: Refreshing state... [id=agmr-29ugyjajxi-gh64ad-GET-400]
module.api.aws_api_gateway_method_response.weight_targets_id_method_res_get_200: Refreshing state... [id=agmr-29ugyjajxi-tp6pe7-GET-200]
module.api.aws_api_gateway_method_response.weight_targets_id_method_res_get_400: Refreshing state... [id=agmr-29ugyjajxi-tp6pe7-GET-400]
module.api.aws_api_gateway_method_response.weight_targets_id_method_res_get_500: Refreshing state... [id=agmr-29ugyjajxi-tp6pe7-GET-500]
module.api.aws_api_gateway_method_response.weight_targets_method_post_500: Refreshing state... [id=agmr-29ugyjajxi-ovn852-POST-500]
module.api.aws_api_gateway_method_response.weight_targets_method_post_200: Refreshing state... [id=agmr-29ugyjajxi-ovn852-POST-200]
module.api.aws_api_gateway_method_response.weight_targets_method_post_400: Refreshing state... [id=agmr-29ugyjajxi-ovn852-POST-400]
module.api.aws_api_gateway_integration_response.weight_targets_integration_get_res_200: Refreshing state... [id=agir-29ugyjajxi-ovn852-GET-200]
module.api.aws_api_gateway_integration_response.weight_targets_integration_get_res_400: Refreshing state... [id=agir-29ugyjajxi-ovn852-GET-400]
module.api.aws_api_gateway_integration_response.weight_targets_integration_res_get_500: Refreshing state... [id=agir-29ugyjajxi-ovn852-GET-500]
module.api.aws_api_gateway_integration_response.weight_measurements_integration_get_res_400: Refreshing state... [id=agir-29ugyjajxi-gh64ad-GET-400]
module.api.aws_api_gateway_integration_response.weight_targets_id_integration_res_get_200: Refreshing state... [id=agir-29ugyjajxi-tp6pe7-GET-200]
module.api.aws_api_gateway_integration_response.weight_targets_integration_res_post_500: Refreshing state... [id=agir-29ugyjajxi-ovn852-POST-500]
module.api.aws_api_gateway_integration_response.weight_measurements_integration_get_res_200: Refreshing state... [id=agir-29ugyjajxi-gh64ad-GET-200]
module.api.aws_api_gateway_integration_response.weight_targets_integration_res_post_200: Refreshing state... [id=agir-29ugyjajxi-ovn852-POST-200]
module.api.aws_api_gateway_integration_response.weight_targets_integration_res_post_400: Refreshing state... [id=agir-29ugyjajxi-ovn852-POST-400]
module.api.aws_api_gateway_integration_response.weight_targets_id_integration_res_get_500: Refreshing state... [id=agir-29ugyjajxi-tp6pe7-GET-500]
module.api.aws_api_gateway_integration_response.weight_measurements_integration_res_get_500: Refreshing state... [id=agir-29ugyjajxi-gh64ad-GET-500]
module.api.aws_api_gateway_integration_response.weight_targets_id_integration_res_get_400: Refreshing state... [id=agir-29ugyjajxi-tp6pe7-GET-400]
module.api.aws_api_gateway_deployment.jowe_api_deployment: Refreshing state... [id=ymp2cf]
module.api.aws_api_gateway_method_response.weight_measurements_method_post_400: Refreshing state... [id=agmr-29ugyjajxi-gh64ad-POST-400]
module.api.aws_api_gateway_method_response.weight_measurements_method_post_200: Refreshing state... [id=agmr-29ugyjajxi-gh64ad-POST-200]
module.api.aws_api_gateway_method_response.weight_measurements_method_post_500: Refreshing state... [id=agmr-29ugyjajxi-gh64ad-POST-500]
module.api.aws_api_gateway_integration_response.weight_measurements_integration_res_post_400: Refreshing state... [id=agir-29ugyjajxi-gh64ad-POST-400]
module.api.aws_api_gateway_integration_response.weight_measurements_integration_res_post_500: Refreshing state... [id=agir-29ugyjajxi-gh64ad-POST-500]
module.api.aws_api_gateway_integration_response.weight_measurements_integration_res_post_200: Refreshing state... [id=agir-29ugyjajxi-gh64ad-POST-200]
module.api.aws_api_gateway_stage.jowe_stage: Refreshing state... [id=ags-29ugyjajxi-prod]
module.api.aws_api_gateway_base_path_mapping.custom_domain_name_stage_mapping: Refreshing state... [id=jowe-api.initialised.si/]
module.lambda.aws_lambda_layer_version.weight_shared_layer: Drift detected (update)
module.lambda.aws_lambda_layer_version.common_layer: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.api.aws_api_gateway_deployment.jowe_api_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "jowe_api_deployment" {
      ~ created_date  = "2023-05-26T21:58:33Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:eu-south-1:834514932971:29ugyjajxi/" -> (known after apply)
      ~ id            = "ymp2cf" -> (known after apply)
      ~ invoke_url    = "https://29ugyjajxi.execute-api.eu-south-1.amazonaws.com/" -> (known after apply)
      ~ variables     = { # forces replacement
          - "deployed_at" = "2023-05-26T21:58:33Z"
        } -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration.delete_user_data_integration_options will be updated in-place
  ~ resource "aws_api_gateway_integration" "delete_user_data_integration_options" {
        id                   = "agi-29ugyjajxi-hpn5zy-OPTIONS"
      ~ request_templates    = {
          ~ "application/json" = jsonencode( # whitespace changes
                {
                    statusCode = 200
                }
            )
        }
        # (10 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration.weight_measurements_id_integration_delete will be updated in-place
  ~ resource "aws_api_gateway_integration" "weight_measurements_id_integration_delete" {
        id                      = "agi-29ugyjajxi-ywsgvl-DELETE"
      ~ request_templates       = {
          ~ "application/json" = jsonencode( # whitespace changes
                {
                    measurementId = "$input.params('measurementId')"
                    userId        = "$context.authorizer.claims.sub"
                }
            )
        }
        # (12 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration.weight_measurements_id_integration_get will be updated in-place
  ~ resource "aws_api_gateway_integration" "weight_measurements_id_integration_get" {
        id                      = "agi-29ugyjajxi-ywsgvl-GET"
      ~ request_templates       = {
          ~ "application/json" = jsonencode( # whitespace changes
                {
                    measurementId = "$input.params('measurementId')"
                    type          = "single"
                    userId        = "$context.authorizer.claims.sub"
                }
            )
        }
        # (12 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration.weight_measurements_id_integration_options will be updated in-place
  ~ resource "aws_api_gateway_integration" "weight_measurements_id_integration_options" {
        id                   = "agi-29ugyjajxi-ywsgvl-OPTIONS"
      ~ request_templates    = {
          ~ "application/json" = jsonencode( # whitespace changes
                {
                    statusCode = 200
                }
            )
        }
        # (10 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration.weight_measurements_integration_get will be updated in-place
  ~ resource "aws_api_gateway_integration" "weight_measurements_integration_get" {
        id                      = "agi-29ugyjajxi-gh64ad-GET"
      ~ request_templates       = {
          ~ "application/json" = jsonencode( # whitespace changes
                {
                    type   = "all"
                    userId = "$context.authorizer.claims.sub"
                }
            )
        }
        # (12 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration.weight_measurements_integration_options will be updated in-place
  ~ resource "aws_api_gateway_integration" "weight_measurements_integration_options" {
        id                   = "agi-29ugyjajxi-gh64ad-OPTIONS"
      ~ request_templates    = {
          ~ "application/json" = jsonencode( # whitespace changes
                {
                    statusCode = 200
                }
            )
        }
        # (10 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration.weight_measurements_integration_post will be updated in-place
  ~ resource "aws_api_gateway_integration" "weight_measurements_integration_post" {
        id                      = "agi-29ugyjajxi-gh64ad-POST"
      ~ request_templates       = {
          ~ "application/json" = <<-EOT
              - #set($inputRoot = $input.path('$'))
              - #set($hasNote =  $input.path('$.measurement.note') != "")
              - #set($hasBodyFatPercentage =  $input.path('$.measurement.measurements.bodyFatPercentage') != "")
              - #set($hasWaterPercentage = $input.path('$.measurement.measurements.waterPercentage') != "")
              - #set($hasMuscleMassPercentage = $input.path('$.measurement.measurements.muscleMassPercentage') != "")
              - #set($hasBonePercentage = $input.path('$.measurement.measurements.bonePercentage') != "")
              - #set($hasEnergyExpenditure = $input.path('$.measurement.measurements.energyExpenditure') != "")
              - {
              -   "measurement" : {
              -     "userId": "$context.authorizer.claims.sub",
              -     "date": $inputRoot.measurement.date,
              -     #if($hasNote) "note": "$inputRoot.measurement.note", #end
              -     "measurements": {
              -       "weight" : $inputRoot.measurement.measurements.weight
              -       #if($hasBodyFatPercentage), "bodyFatPercentage": $inputRoot.measurement.measurements.bodyFatPercentage #end
              -       #if($hasWaterPercentage), "waterPercentage": $inputRoot.measurement.measurements.waterPercentage #end
              -       #if($hasMuscleMassPercentage), "muscleMassPercentage": $inputRoot.measurement.measurements.muscleMassPercentage #end
              -       #if($hasBonePercentage), "bonePercentage": $inputRoot.measurement.measurements.bonePercentage #end
              -       #if($hasEnergyExpenditure), "energyExpenditure": $inputRoot.measurement.measurements.energyExpenditure #end
              -     }
              -   }
              + #set($inputRoot = $input.path('$'))
              + #set($hasNote =  $input.path('$.measurement.note') != "")
              + #set($hasBodyFatPercentage =  $input.path('$.measurement.measurements.bodyFatPercentage') != "")
              + #set($hasWaterPercentage = $input.path('$.measurement.measurements.waterPercentage') != "")
              + #set($hasMuscleMassPercentage = $input.path('$.measurement.measurements.muscleMassPercentage') != "")
              + #set($hasBonePercentage = $input.path('$.measurement.measurements.bonePercentage') != "")
              + #set($hasEnergyExpenditure = $input.path('$.measurement.measurements.energyExpenditure') != "")
              + {
              +   "measurement" : {
              +     "userId": "$context.authorizer.claims.sub",
              +     "date": $inputRoot.measurement.date,
              +     #if($hasNote) "note": "$inputRoot.measurement.note", #end
              +     "measurements": {
              +       "weight" : $inputRoot.measurement.measurements.weight
              +       #if($hasBodyFatPercentage), "bodyFatPercentage": $inputRoot.measurement.measurements.bodyFatPercentage #end
              +       #if($hasWaterPercentage), "waterPercentage": $inputRoot.measurement.measurements.waterPercentage #end
              +       #if($hasMuscleMassPercentage), "muscleMassPercentage": $inputRoot.measurement.measurements.muscleMassPercentage #end
              +       #if($hasBonePercentage), "bonePercentage": $inputRoot.measurement.measurements.bonePercentage #end
              +       #if($hasEnergyExpenditure), "energyExpenditure": $inputRoot.measurement.measurements.energyExpenditure #end
              +     }
              +   }
                }
            EOT
        }
        # (12 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration.weight_targets_id_integration_delete will be updated in-place
  ~ resource "aws_api_gateway_integration" "weight_targets_id_integration_delete" {
        id                      = "agi-29ugyjajxi-tp6pe7-DELETE"
      ~ request_templates       = {
          ~ "application/json" = jsonencode( # whitespace changes
                {
                    recordId = "$input.params('recordId')"
                    userId   = "$context.authorizer.claims.sub"
                }
            )
        }
        # (12 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration.weight_targets_id_integration_get will be updated in-place
  ~ resource "aws_api_gateway_integration" "weight_targets_id_integration_get" {
        id                      = "agi-29ugyjajxi-tp6pe7-GET"
      ~ request_templates       = {
          ~ "application/json" = jsonencode( # whitespace changes
                {
                    recordId = "$input.params('recordId')"
                    type     = "single"
                    userId   = "$context.authorizer.claims.sub"
                }
            )
        }
        # (12 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration.weight_targets_id_integration_options will be updated in-place
  ~ resource "aws_api_gateway_integration" "weight_targets_id_integration_options" {
        id                   = "agi-29ugyjajxi-tp6pe7-OPTIONS"
      ~ request_templates    = {
          ~ "application/json" = jsonencode( # whitespace changes
                {
                    statusCode = 200
                }
            )
        }
        # (10 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration.weight_targets_integration_get will be updated in-place
  ~ resource "aws_api_gateway_integration" "weight_targets_integration_get" {
        id                      = "agi-29ugyjajxi-ovn852-GET"
      ~ request_templates       = {
          ~ "application/json" = jsonencode( # whitespace changes
                {
                    type   = "all"
                    userId = "$context.authorizer.claims.sub"
                }
            )
        }
        # (12 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration.weight_targets_integration_options will be updated in-place
  ~ resource "aws_api_gateway_integration" "weight_targets_integration_options" {
        id                   = "agi-29ugyjajxi-ovn852-OPTIONS"
      ~ request_templates    = {
          ~ "application/json" = jsonencode( # whitespace changes
                {
                    statusCode = 200
                }
            )
        }
        # (10 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration.weight_targets_integration_post will be updated in-place
  ~ resource "aws_api_gateway_integration" "weight_targets_integration_post" {
        id                      = "agi-29ugyjajxi-ovn852-POST"
      ~ request_templates       = {
          ~ "application/json" = <<-EOT
              - #set($inputRoot = $input.path('$'))
              - {
              -   "userId": "$context.authorizer.claims.sub",
              -   "targetWeight": $inputRoot.targetWeight
              + #set($inputRoot = $input.path('$'))
              + {
              +   "userId": "$context.authorizer.claims.sub",
              +   "targetWeight": $inputRoot.targetWeight
                }
            EOT
        }
        # (12 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.delete_user_data_integration_res_post_500 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "delete_user_data_integration_res_post_500" {
        id                  = "agir-29ugyjajxi-hpn5zy-POST-500"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              - {
              -   "errorMsg": "$errJson.body.error"
              + #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              + {
              +   "errorMsg": "$errJson.body.error"
                }
            EOT
        }
        # (6 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.weight_measurements_id_integration_res_delete_500 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "weight_measurements_id_integration_res_delete_500" {
        id                  = "agir-29ugyjajxi-ywsgvl-DELETE-500"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              - {
              -   "errorMsg": "$errJson.body.error"
              + #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              + {
              +   "errorMsg": "$errJson.body.error"
                }
            EOT
        }
        # (6 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.weight_measurements_id_integration_res_get_200 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "weight_measurements_id_integration_res_get_200" {
        id                  = "agir-29ugyjajxi-ywsgvl-GET-200"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - {
              -   "measurement": $input.json('$.body.measurement')
              + {
              +   "measurement": $input.json('$.body.measurement')
                }
            EOT
        }
        # (5 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.weight_measurements_id_integration_res_get_400 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "weight_measurements_id_integration_res_get_400" {
        id                  = "agir-29ugyjajxi-ywsgvl-GET-400"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              - {
              -   "errorMsg": "$errJson.body.error"
              + #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              + {
              +   "errorMsg": "$errJson.body.error"
                }
            EOT
        }
        # (6 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.weight_measurements_id_integration_res_get_500 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "weight_measurements_id_integration_res_get_500" {
        id                  = "agir-29ugyjajxi-ywsgvl-GET-500"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              - {
              -   "errorMsg": "$errJson.body.error"
              + #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              + {
              +   "errorMsg": "$errJson.body.error"
                }
            EOT
        }
        # (6 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.weight_measurements_integration_get_res_200 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "weight_measurements_integration_get_res_200" {
        id                  = "agir-29ugyjajxi-gh64ad-GET-200"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($hasNoMeasurements =  $input.json('$.body.measurements').isEmpty())
              - {
              -   "measurements": #if($hasNoMeasurements) [] #else $input.json('$.body.measurements') #end
              + #set($hasNoMeasurements =  $input.json('$.body.measurements').isEmpty())
              + {
              +   "measurements": #if($hasNoMeasurements) [] #else $input.json('$.body.measurements') #end
                }
            EOT
        }
        # (5 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.weight_measurements_integration_get_res_400 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "weight_measurements_integration_get_res_400" {
        id                  = "agir-29ugyjajxi-gh64ad-GET-400"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              - {
              -   "errorMsg": "$errJson.body.error"
              + #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              + {
              +   "errorMsg": "$errJson.body.error"
                }
            EOT
        }
        # (6 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.weight_measurements_integration_res_get_500 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "weight_measurements_integration_res_get_500" {
        id                  = "agir-29ugyjajxi-gh64ad-GET-500"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              - {
              -   "errorMsg": "$errJson.body.error"
              + #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              + {
              +   "errorMsg": "$errJson.body.error"
                }
            EOT
        }
        # (6 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.weight_measurements_integration_res_post_200 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "weight_measurements_integration_res_post_200" {
        id                  = "agir-29ugyjajxi-gh64ad-POST-200"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($hasMeasurement =  $input.json('$.body.measurements')  != "")
              - {
              -   "measurement": #if($hasMeasurement) $input.json('$.body.measurement') #else {} #end
              + #set($hasMeasurement =  $input.json('$.body.measurements')  != "")
              + {
              +   "measurement": #if($hasMeasurement) $input.json('$.body.measurement') #else {} #end
                }
            EOT
        }
        # (5 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.weight_measurements_integration_res_post_400 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "weight_measurements_integration_res_post_400" {
        id                  = "agir-29ugyjajxi-gh64ad-POST-400"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              - {
              -   "errorMsg": "$errJson.body.error"
              + #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              + {
              +   "errorMsg": "$errJson.body.error"
                }
            EOT
        }
        # (6 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.weight_measurements_integration_res_post_500 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "weight_measurements_integration_res_post_500" {
        id                  = "agir-29ugyjajxi-gh64ad-POST-500"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              - {
              -   "errorMsg": "$errJson.body.error"
              + #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              + {
              +   "errorMsg": "$errJson.body.error"
                }
            EOT
        }
        # (6 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.weight_targets_id_integration_res_delete_500 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "weight_targets_id_integration_res_delete_500" {
        id                  = "agir-29ugyjajxi-tp6pe7-DELETE-500"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              - {
              -   "errorMsg": "$errJson.body.error"
              + #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              + {
              +   "errorMsg": "$errJson.body.error"
                }
            EOT
        }
        # (6 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.weight_targets_id_integration_res_get_200 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "weight_targets_id_integration_res_get_200" {
        id                  = "agir-29ugyjajxi-tp6pe7-GET-200"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - {
              -   "target": $input.json('$.body.target')
              + {
              +   "target": $input.json('$.body.target')
                }
            EOT
        }
        # (5 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.weight_targets_id_integration_res_get_400 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "weight_targets_id_integration_res_get_400" {
        id                  = "agir-29ugyjajxi-tp6pe7-GET-400"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              - {
              -   "errorMsg": "$errJson.body.error"
              + #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              + {
              +   "errorMsg": "$errJson.body.error"
                }
            EOT
        }
        # (6 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.weight_targets_id_integration_res_get_500 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "weight_targets_id_integration_res_get_500" {
        id                  = "agir-29ugyjajxi-tp6pe7-GET-500"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              - {
              -   "errorMsg": "$errJson.body.error"
              + #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              + {
              +   "errorMsg": "$errJson.body.error"
                }
            EOT
        }
        # (6 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.weight_targets_integration_get_res_200 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "weight_targets_integration_get_res_200" {
        id                  = "agir-29ugyjajxi-ovn852-GET-200"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($hasNoTargets =  $input.json('$.body.targetWeights').isEmpty())
              - {
              -   "targetWeights": #if($hasNoTargets) [] #else $input.json('$.body.targetWeights') #end
              + #set($hasNoTargets =  $input.json('$.body.targetWeights').isEmpty())
              + {
              +   "targetWeights": #if($hasNoTargets) [] #else $input.json('$.body.targetWeights') #end
                }
            EOT
        }
        # (5 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.weight_targets_integration_get_res_400 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "weight_targets_integration_get_res_400" {
        id                  = "agir-29ugyjajxi-ovn852-GET-400"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              - {
              -   "errorMsg": "$errJson.body.error"
              + #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              + {
              +   "errorMsg": "$errJson.body.error"
                }
            EOT
        }
        # (6 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.weight_targets_integration_res_get_500 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "weight_targets_integration_res_get_500" {
        id                  = "agir-29ugyjajxi-ovn852-GET-500"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              - {
              -   "errorMsg": "$errJson.body.error"
              + #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              + {
              +   "errorMsg": "$errJson.body.error"
                }
            EOT
        }
        # (6 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.weight_targets_integration_res_post_200 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "weight_targets_integration_res_post_200" {
        id                  = "agir-29ugyjajxi-ovn852-POST-200"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($hasTarget =  $input.json('$.body.targetWeight')  != "")
              - {
              -   "target": #if($hasTarget) $input.json('$.body.targetWeight') #else {} #end
              + #set($hasTarget =  $input.json('$.body.targetWeight')  != "")
              + {
              +   "target": #if($hasTarget) $input.json('$.body.targetWeight') #else {} #end
                }
            EOT
        }
        # (5 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.weight_targets_integration_res_post_400 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "weight_targets_integration_res_post_400" {
        id                  = "agir-29ugyjajxi-ovn852-POST-400"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              - {
              -   "errorMsg": "$errJson.body.error"
              + #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              + {
              +   "errorMsg": "$errJson.body.error"
                }
            EOT
        }
        # (6 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.weight_targets_integration_res_post_500 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "weight_targets_integration_res_post_500" {
        id                  = "agir-29ugyjajxi-ovn852-POST-500"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              - {
              -   "errorMsg": "$errJson.body.error"
              + #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              + {
              +   "errorMsg": "$errJson.body.error"
                }
            EOT
        }
        # (6 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_stage.jowe_stage will be updated in-place
  ~ resource "aws_api_gateway_stage" "jowe_stage" {
      ~ deployment_id         = "ymp2cf" -> (known after apply)
        id                    = "ags-29ugyjajxi-prod"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

  # module.lambda.aws_lambda_function.weight_measurements_delete_lambda will be updated in-place
  ~ resource "aws_lambda_function" "weight_measurements_delete_lambda" {
        id                             = "JoWe-api-weight-measurements-delete"
      ~ last_modified                  = "2023-05-26T21:57:34.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-common-layer:23",
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-weight-shared-layer:9",
        ] -> (known after apply)
      ~ source_code_hash               = "S2xQ1v2mLY5HLaWT0F1caVzU6k55RwfVF1n/f7ff50Y=" -> "AATZ7ANt2aMm9t04VSfKe4pDO9GNXPqdsgawJVAkhOk="
        tags                           = {
            "App"         = "JoWe"
            "Environment" = "prod"
            "Name"        = "JoWe-api-weight-measurements-delete"
        }
        # (19 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_function.weight_measurements_delete_user_data_lambda will be updated in-place
  ~ resource "aws_lambda_function" "weight_measurements_delete_user_data_lambda" {
        id                             = "JoWe-api-weight-measurements-delete-user-data"
      ~ last_modified                  = "2023-05-26T21:58:09.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-common-layer:23",
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-weight-shared-layer:9",
        ] -> (known after apply)
      ~ source_code_hash               = "7lSFeD4d63piBG/s0R+AaTie3zOe0q5FSN1FtNoU2ww=" -> "entKp4gIEPjPhJd1VaoAU505TXz8qrIMbjHD8M8PMOA="
        tags                           = {
            "App"         = "JoWe"
            "Environment" = "prod"
            "Name"        = "JoWe-api-weight-measurements-delete-user-data"
        }
        # (19 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_function.weight_measurements_insert_lambda will be updated in-place
  ~ resource "aws_lambda_function" "weight_measurements_insert_lambda" {
        id                             = "JoWe-api-weight-measurements-insert"
      ~ last_modified                  = "2023-05-26T21:57:52.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-common-layer:23",
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-weight-shared-layer:9",
        ] -> (known after apply)
      ~ source_code_hash               = "F/bLJV4uRrgay8agRPkSBGKOjxV2JLQ1FovOlKqoL+g=" -> "Sk1o9KZwv6RpVpq8chZq2JM6OASY+KVFm/Gzgcvk3sg="
        tags                           = {
            "App"         = "JoWe"
            "Environment" = "prod"
            "Name"        = "JoWe-api-weight-measurements-insert"
        }
        # (19 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_function.weight_measurements_retrieve_lambda will be updated in-place
  ~ resource "aws_lambda_function" "weight_measurements_retrieve_lambda" {
        id                             = "JoWe-api-weight-measurements-retrieve"
      ~ last_modified                  = "2023-05-26T21:58:17.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-common-layer:23",
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-weight-shared-layer:9",
        ] -> (known after apply)
      ~ source_code_hash               = "GM/l1XFrRE6M8tthhWifP4ynDKPnazVOt9U69j8oNx8=" -> "5JwXeSldZN4PQp/+5g9Xe8MxrvMyLdFsWUveNNjVRTI="
        tags                           = {
            "App"         = "JoWe"
            "Environment" = "prod"
            "Name"        = "JoWe-api-weight-measurements-retrieve"
        }
        # (19 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_function.weight_targets_delete_lambda will be updated in-place
  ~ resource "aws_lambda_function" "weight_targets_delete_lambda" {
        id                             = "JoWe-api-weight-targets-delete"
      ~ last_modified                  = "2023-05-26T21:58:00.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-common-layer:23",
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-weight-shared-layer:9",
        ] -> (known after apply)
      ~ source_code_hash               = "v3dwhNBpLlvPHEtFqQ9ys9mb+tXCED2J9SuLKSMzaJE=" -> "lSvSpFwNsBD3PkYFRBUz2WcPS3MUjZ6ZGhrmh+5TCfA="
        tags                           = {
            "App"         = "JoWe"
            "Environment" = "prod"
            "Name"        = "JoWe-api-weight-targets-delete"
        }
        # (19 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_function.weight_targets_delete_user_data_lambda will be updated in-place
  ~ resource "aws_lambda_function" "weight_targets_delete_user_data_lambda" {
        id                             = "JoWe-api-weight-targets-delete-user-data"
      ~ last_modified                  = "2023-05-26T21:57:43.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-common-layer:23",
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-weight-shared-layer:9",
        ] -> (known after apply)
      ~ source_code_hash               = "UMg9teAPd3GAwIq2PsLNyvzaONkz23LX7yibVLWRGH4=" -> "EiBP540FkI6Ztgu5sq+8X6EhZZPBV5baloLRvuxuWAU="
        tags                           = {
            "App"         = "JoWe"
            "Environment" = "prod"
            "Name"        = "JoWe-api-weight-targets-delete"
        }
        # (19 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_function.weight_targets_insert_lambda will be updated in-place
  ~ resource "aws_lambda_function" "weight_targets_insert_lambda" {
        id                             = "JoWe-api-weight-targets-insert"
      ~ last_modified                  = "2023-05-26T21:58:27.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-common-layer:23",
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-weight-shared-layer:9",
        ] -> (known after apply)
      ~ source_code_hash               = "iTuRpQ8kguz6saKsnkidYXDGJAGMUYdAM28n6GlOAFc=" -> "VhhYI+0USenSEwJedvsosmpxchjD/KL9U8y1ywK1SQ4="
        tags                           = {
            "App"         = "JoWe"
            "Environment" = "prod"
            "Name"        = "JoWe-api-weight-targets-insert"
        }
        # (19 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_function.weight_targets_retrieve_lambda will be updated in-place
  ~ resource "aws_lambda_function" "weight_targets_retrieve_lambda" {
        id                             = "JoWe-api-weight-targets-retrieve"
      ~ last_modified                  = "2023-05-26T21:57:25.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-common-layer:23",
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-weight-shared-layer:9",
        ] -> (known after apply)
      ~ source_code_hash               = "eSeVKSYSxgO53UmvLVo1rVFz72xTJp+OgglvsW7XLck=" -> "FM7WX4TIxPxWqHwj3r1h/tMF+6NHZBslrGkE8VaoSHI="
        tags                           = {
            "App"         = "JoWe"
            "Environment" = "prod"
            "Name"        = "JoWe-api-weight-targets-retrieve"
        }
        # (19 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_layer_version.common_layer must be replaced
+/- resource "aws_lambda_layer_version" "common_layer" {
      ~ arn                         = "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-common-layer:23" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2023-05-26T21:57:14.581+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-common-layer:23" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-common-layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "H4PYslmkWQOXzk2X825G/nUI3Kz56DhtH2hhzjHyLUg=" -> "RmU5fIQBJwZDdwGh3tKb2zX1P0JaN1WXtGOKYlPT3Ik=" # forces replacement
      ~ source_code_size            = 2046 -> (known after apply)
      ~ version                     = "23" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.lambda.aws_lambda_layer_version.weight_shared_layer must be replaced
+/- resource "aws_lambda_layer_version" "weight_shared_layer" {
      ~ arn                         = "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-weight-shared-layer:9" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2023-05-26T21:57:10.236+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-weight-shared-layer:9" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-weight-shared-layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "nMO0bq6kbVvsRl2WRTA7Cxd9GreSSLEN2zXJEfk8v2k=" -> "uz2PVXLK4koBfOiAsQIR5zUgI3qbD/SPQ0nseme34zM=" # forces replacement
      ~ source_code_size            = 1940 -> (known after apply)
      ~ version                     = "9" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 3 to add, 43 to change, 3 to destroy.

```

</details>

*Pushed by: @Andrej988, Action: `pull_request`*